
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do src/cohorts.do 

. use "temp/data.dta", clear

. 
. do "src/create/variables.do"

. generate lnL = ln(employment_from_balance)

. generate exporter = export > 0

. generate lnQ = ln(sales)

. generate lnK = ln(tanass_clean)
(2 missing values generated)

. generate lnM = ln(ranyag)
(2 missing values generated)

. generate foreign = fo3

. 
. regress lnQ lnK lnL lnM

      Source |       SS           df       MS      Number of obs   =       114
-------------+----------------------------------   F(3, 110)       =   1391.14
       Model |  244.381324         3  81.4604414   Prob > F        =    0.0000
    Residual |  6.44124363       110   .05855676   R-squared       =    0.9743
-------------+----------------------------------   Adj R-squared   =    0.9736
       Total |  250.822568       113  2.21966874   Root MSE        =    .24199

------------------------------------------------------------------------------
         lnQ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         lnK |   .0519114   .0245512     2.11   0.037     .0032568    .1005661
         lnL |   .1977643   .0369054     5.36   0.000     .1246266    .2709021
         lnM |   .7586059    .023559    32.20   0.000     .7119176    .8052943
       _cons |   2.277995   .2074069    10.98   0.000     1.866963    2.689027
------------------------------------------------------------------------------

. predict TFP, resid
(4 missing values generated)

. 
. replace birth_year_firm = foundyear
(91 real changes made)

. 
end of do-file

. 
. local T1 1945

. local T2 1995

. local k 5

. local offset 25

. rename first_year_in_market birth_year_entry

. 
. replace birth_year_firm = birth_year_firm - `offset'
(118 real changes made)

. replace birth_year_entry = birth_year_entry - `offset'
(118 real changes made)

. 
. foreach i in ceo respondent firm entry {
  2.     generate cohort_`i' = birth_year_`i'
  3.     replace cohort_`i' = `T1' if cohort_`i' <= `T1'
  4.     replace cohort_`i' = `T2' if cohort_`i' > `T2' & !missing(cohort_`i')
  5.     replace cohort_`i' = int(cohort_`i'/`k') * `k'
  6.     * people who were 20 in 1985 could already been exposed to business ed
> ucation
.     generate byte modern_`i' = birth_year_`i' >= 1965 if !missing(birth_year_
> `i')
  7.     generate byte goldrush_`i' = inrange(birth_year_`i', 1965, 1974)
  8. }
(3 missing values generated)
(2 real changes made)
(0 real changes made)
(93 real changes made)
(3 missing values generated)
(1 real change made)
(0 real changes made)
(90 real changes made)
(4 real changes made)
(0 real changes made)
(87 real changes made)
(1 real change made)
(0 real changes made)
(88 real changes made)

. replace birth_year_firm = birth_year_firm + `offset'
(118 real changes made)

. replace birth_year_entry = birth_year_entry + `offset'
(118 real changes made)

. replace cohort_firm = cohort_firm + `offset'
(118 real changes made)

. replace cohort_entry = cohort_entry + `offset'
(118 real changes made)

. 
. foreach X in comp_tenure post_tenure {
  2.     replace `X' = int(`X'/`k') * `k'
  3. }
(76 real changes made)
(75 real changes made)

. 
. tabulate cohort_firm

cohort_firm |      Freq.     Percent        Cum.
------------+-----------------------------------
       1970 |          5        4.24        4.24
       1980 |          1        0.85        5.08
       1985 |          6        5.08       10.17
       1990 |         46       38.98       49.15
       1995 |         29       24.58       73.73
       2000 |         17       14.41       88.14
       2005 |          8        6.78       94.92
       2010 |          6        5.08      100.00
------------+-----------------------------------
      Total |        118      100.00

. tabulate cohort_ceo

 cohort_ceo |      Freq.     Percent        Cum.
------------+-----------------------------------
       1945 |          7        6.09        6.09
       1950 |         14       12.17       18.26
       1955 |         19       16.52       34.78
       1960 |         18       15.65       50.43
       1965 |         16       13.91       64.35
       1970 |         22       19.13       83.48
       1975 |         10        8.70       92.17
       1980 |          6        5.22       97.39
       1985 |          3        2.61      100.00
------------+-----------------------------------
      Total |        115      100.00

. tabulate cohort_respondent

cohort_resp |
     ondent |      Freq.     Percent        Cum.
------------+-----------------------------------
       1945 |          3        2.54        2.54
       1950 |          4        3.39        5.93
       1955 |         11        9.32       15.25
       1960 |          9        7.63       22.88
       1965 |         13       11.02       33.90
       1970 |         20       16.95       50.85
       1975 |         26       22.03       72.88
       1980 |         21       17.80       90.68
       1985 |          9        7.63       98.31
       1990 |          2        1.69      100.00
------------+-----------------------------------
      Total |        118      100.00

. tabulate modern_ceo modern_respondent

           |   modern_respondent
modern_ceo |         0          1 |     Total
-----------+----------------------+----------
         0 |        23         35 |        58 
         1 |         4         53 |        57 
-----------+----------------------+----------
     Total |        27         88 |       115 

. tabulate modern_respondent goldrush_respondent

modern_res |  goldrush_respondent
   pondent |         0          1 |     Total
-----------+----------------------+----------
         0 |        27          0 |        27 
         1 |        58         33 |        91 
-----------+----------------------+----------
     Total |        85         33 |       118 

. 
. summarize management [aw=weight], detail

                  ADJUSTED MANAGEMENT SCORE
-------------------------------------------------------------
      Percentiles      Smallest
 1%     1.259873       1.167021
 5%     1.597149       1.259873
10%     1.763816       1.263816       Obs                 118
25%      2.20826       1.263816       Sum of wgt.  199.285845

50%     2.936157                      Mean           2.839376
                        Largest       Std. dev.       .722534
75%     3.319371       4.055909
90%     3.763816       4.097149       Variance       .5220553
95%     3.989866       4.222576       Skewness      -.3005594
99%     4.222576       4.269489       Kurtosis       2.387017

. regress management i.cohort_respondent [pw=weight], cluster(tax_id)
(sum of wgt is 199.2858448)

Linear regression                               Number of obs     =        118
                                                F(9, 117)         =      20.52
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2292
                                                Root MSE          =     .66023

                               (Std. err. adjusted for 118 clusters in tax_id)
------------------------------------------------------------------------------
             |               Robust
  management | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
cohort_res~t |
       1950  |   .1623757   .3313033     0.49   0.625    -.4937532    .8185046
       1955  |   .9955519   .1798927     5.53   0.000     .6392839     1.35182
       1960  |   1.061157   .2810014     3.78   0.000     .5046488    1.617666
       1965  |   1.523044   .2018675     7.54   0.000     1.123256    1.922832
       1970  |    1.47129   .1583107     9.29   0.000     1.157764    1.784816
       1975  |   .9173748   .2000262     4.59   0.000     .5212334    1.313516
       1980  |   1.211346   .1877505     6.45   0.000     .8395156    1.583176
       1985  |   1.206054   .2702804     4.46   0.000     .6707778     1.74133
       1990  |   1.643269   .1303114    12.61   0.000     1.385194    1.901344
             |
       _cons |   1.719479   .1101622    15.61   0.000     1.501308    1.937649
------------------------------------------------------------------------------

. outreg2 using "output/tables/management-cohort-resp.tex", replace tex(frag pr
> )
output/tables/management-cohort-resp.tex
dir : seeout

. 
. foreach X in cohort_firm cohort_ceo cohort_respondent cohort_entry comp_tenur
> e post_tenure {
  2.     regress management i.`X' [pw=weight], cluster(tax_id)
  3.     outreg2 using "output/tables/management-`X'.tex", replace tex(frag pr)
  4. }
(sum of wgt is 199.2858448)

Linear regression                               Number of obs     =        118
                                                F(6, 117)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1064
                                                Root MSE          =     .70442

                               (Std. err. adjusted for 118 clusters in tax_id)
------------------------------------------------------------------------------
             |               Robust
  management | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
 cohort_firm |
       1980  |  -1.204616    .189401    -6.36   0.000    -1.579715   -.8295176
       1985  |   .0579992   .2886512     0.20   0.841    -.5136594    .6296578
       1990  |  -.4958509   .2146589    -2.31   0.023    -.9209716   -.0707303
       1995  |  -.5490595   .2486811    -2.21   0.029    -1.041559   -.0565596
       2000  |   -.371701   .2443857    -1.52   0.131     -.855694     .112292
       2005  |   .1764411   .2788041     0.63   0.528    -.3757158     .728598
       2010  |  -.6461351   .3890489    -1.66   0.099    -1.416626    .1243559
             |
       _cons |   3.253306    .189401    17.18   0.000     2.878208    3.628405
------------------------------------------------------------------------------
output/tables/management-cohort_firm.tex
dir : seeout
(sum of wgt is 195.0050857)

Linear regression                               Number of obs     =        115
                                                F(8, 114)         =      23.30
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2318
                                                Root MSE          =     .65806

                               (Std. err. adjusted for 115 clusters in tax_id)
------------------------------------------------------------------------------
             |               Robust
  management | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  cohort_ceo |
       1950  |   .1744273   .3131544     0.56   0.579    -.4459292    .7947837
       1955  |   .8212159   .2908211     2.82   0.006     .2451015     1.39733
       1960  |   1.076304   .2440508     4.41   0.000     .5928415    1.559767
       1965  |   .9643005   .2734234     3.53   0.001     .4226509     1.50595
       1970  |   .8986009   .2637848     3.41   0.001     .3760452    1.421157
       1975  |   .7804872   .3011455     2.59   0.011     .1839203    1.377054
       1980  |   .8420469   .3059595     2.75   0.007     .2359435     1.44815
       1985  |   .0197241   .2206452     0.09   0.929    -.4173724    .4568206
             |
       _cons |   2.086665   .2192866     9.52   0.000      1.65226     2.52107
------------------------------------------------------------------------------
output/tables/management-cohort_ceo.tex
dir : seeout
(sum of wgt is 199.2858448)

Linear regression                               Number of obs     =        118
                                                F(9, 117)         =      20.52
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2292
                                                Root MSE          =     .66023

                               (Std. err. adjusted for 118 clusters in tax_id)
------------------------------------------------------------------------------
             |               Robust
  management | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
cohort_res~t |
       1950  |   .1623757   .3313033     0.49   0.625    -.4937532    .8185046
       1955  |   .9955519   .1798927     5.53   0.000     .6392839     1.35182
       1960  |   1.061157   .2810014     3.78   0.000     .5046488    1.617666
       1965  |   1.523044   .2018675     7.54   0.000     1.123256    1.922832
       1970  |    1.47129   .1583107     9.29   0.000     1.157764    1.784816
       1975  |   .9173748   .2000262     4.59   0.000     .5212334    1.313516
       1980  |   1.211346   .1877505     6.45   0.000     .8395156    1.583176
       1985  |   1.206054   .2702804     4.46   0.000     .6707778     1.74133
       1990  |   1.643269   .1303114    12.61   0.000     1.385194    1.901344
             |
       _cons |   1.719479   .1101622    15.61   0.000     1.501308    1.937649
------------------------------------------------------------------------------
output/tables/management-cohort_respondent.tex
dir : seeout
(sum of wgt is 199.2858448)

Linear regression                               Number of obs     =        118
                                                F(8, 117)         =      46.13
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1950
                                                Root MSE          =     .67165

                               (Std. err. adjusted for 118 clusters in tax_id)
------------------------------------------------------------------------------
             |               Robust
  management | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
cohort_entry |
       1980  |   1.004777   .1518024     6.62   0.000     .7041402    1.305414
       1985  |   .3501748    .429663     0.81   0.417    -.5007502      1.2011
       1990  |   .9499741   .1537211     6.18   0.000     .6455376    1.254411
       1995  |   .7791883    .138256     5.64   0.000     .5053795    1.052997
       2000  |   1.237835    .126911     9.75   0.000      .986494    1.489175
       2005  |    1.68701   .1566962    10.77   0.000     1.376681    1.997338
       2010  |    1.09337   .1945208     5.62   0.000     .7081322    1.478609
       2015  |    .745309   .2150484     3.47   0.001     .3194169    1.171201
             |
       _cons |   1.763816   8.98e-08  2.0e+07   0.000     1.763816    1.763816
------------------------------------------------------------------------------
output/tables/management-cohort_entry.tex
dir : seeout
(sum of wgt is 182.2477209)

Linear regression                               Number of obs     =        108
                                                F(10, 107)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2063
                                                Root MSE          =      .6845

                               (Std. err. adjusted for 108 clusters in tax_id)
------------------------------------------------------------------------------
             |               Robust
  management | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
 comp_tenure |
          5  |   .2018033   .2648005     0.76   0.448    -.3231328    .7267394
         10  |  -.0029964   .2591081    -0.01   0.991    -.5166479    .5106551
         15  |  -.0618748   .2816866    -0.22   0.827    -.6202857     .496536
         20  |  -.2359843   .3702524    -0.64   0.525    -.9699664    .4979979
         25  |  -.6843466   .3217857    -2.13   0.036    -1.322249    -.046444
         30  |  -.7531794   .3539959    -2.13   0.036    -1.454935   -.0514238
         35  |   .3240495   .3401265     0.95   0.343    -.3502115    .9983105
         40  |  -1.671366    .212855    -7.85   0.000    -2.093326   -1.249406
         45  |  -.4200592   .3816065    -1.10   0.273     -1.17655     .336431
         50  |   .2765225   .2454688     1.13   0.262    -.2100909    .7631358
         60  |  -.0419013   .2216299    -0.19   0.850    -.4812568    .3974541
             |
       _cons |   2.935182    .212855    13.79   0.000     2.513222    3.357142
------------------------------------------------------------------------------
output/tables/management-comp_tenure.tex
dir : seeout
(sum of wgt is 181.6497976)

Linear regression                               Number of obs     =        109
                                                F(9, 108)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1821
                                                Root MSE          =     .69026

                               (Std. err. adjusted for 109 clusters in tax_id)
------------------------------------------------------------------------------
             |               Robust
  management | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
 post_tenure |
          5  |   .1614196   .2144631     0.75   0.453    -.2636835    .5865227
         10  |  -.1958137   .2537803    -0.77   0.442    -.6988503    .3072228
         15  |   .0736144    .249291     0.30   0.768    -.4205235    .5677523
         20  |  -.2102286   .3597409    -0.58   0.560    -.9232975    .5028402
         25  |  -.8827591   .2512964    -3.51   0.001    -1.380872   -.3846461
         30  |  -.3638394   .4010844    -0.91   0.366    -1.158858    .4311794
         35  |  -.8374197   .6204835    -1.35   0.180    -2.067326    .3924862
         40  |   .6051003   .1648179     3.67   0.000     .2784027     .931798
         45  |   -.121266   .3303818    -0.37   0.714      -.77614    .5336079
         60  |  -.2232719   .2291817    -0.97   0.332    -.6775498    .2310061
             |
       _cons |   2.959161   .1648179    17.95   0.000     2.632463    3.285858
------------------------------------------------------------------------------
output/tables/management-post_tenure.tex
dir : seeout

. 
. local controls foreign entrepreneur

. local ceo_X ceo

. local ceo_controls `controls'

. local respondent_X respondent

. local respondent_controls `controls'

. local respcontrol_X respondent

. local respcontrol_controls i.cohort_ceo `controls'

. local ceodomestic_X ceo

. local ceodomestic_controls `controls' if !expat

. local ceoexpat_X ceo

. local ceoexpat_controls `controls' if expat

. 
. foreach spec in ceo respondent respcontrol ceodomestic ceoexpat {
  2.     local X ``spec'_X'
  3.     local controls ``spec'_controls'
  4.     regress management ib`T1'.cohort_`X' `controls' [pw=weight], cluster(t
> ax_id)
  5.     outreg2 using "output/tables/management-cohort-`X'.tex", tex(frag pr)
  6. 
.     * X axis: cohort of respondency, Y axis, estimated management score, rela
> tive to baseline, 1945
.     margins, dydx(ib1945.cohort_`X')
  7.     marginsplot, recast(scatter) yline(0) nolabels xlabel(1 "1950" 2 "1955
> " 3 "1960" 4 "1965" 5 "1970" 6 "1975" 7 "1980" 8 "1985" 9 "1990") xtitle("Bir
> th year of `X'") ytitle("Management score, relative to 1945")
  8.     graph export "output/fig/cohort-`spec'-marginsplot.png", replace
  9. 
.     histogram cohort_`X', discrete freq width(5) xtitle("Birth year of `X'") 
> ytitle("Number of firms")
 10.     graph export "output/fig/cohort-`spec'-histogram.png", replace
 11. }
(sum of wgt is 195.0050857)

Linear regression                               Number of obs     =        115
                                                F(10, 114)        =      15.60
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3757
                                                Root MSE          =      .5989

                               (Std. err. adjusted for 115 clusters in tax_id)
------------------------------------------------------------------------------
             |               Robust
  management | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  cohort_ceo |
       1950  |   .2280387   .2496841     0.91   0.363    -.2665836    .7226611
       1955  |   .6255583   .2237666     2.80   0.006     .1822784    1.068838
       1960  |   .8709544   .1938728     4.49   0.000     .4868939    1.255015
       1965  |   .7476039   .2181344     3.43   0.001     .3154813    1.179727
       1970  |   .7195994   .2266457     3.17   0.002      .270616    1.168583
       1975  |   .7696551   .2756349     2.79   0.006     .2236245    1.315686
       1980  |   .8248062   .2632978     3.13   0.002     .3032153    1.346397
       1985  |   .1256901   .1764412     0.71   0.478    -.2238386    .4752188
             |
     foreign |   .5185497   .1448787     3.58   0.001     .2315462    .8055532
entrepreneur |  -.1541056    .143677    -1.07   0.286    -.4387285    .1305174
       _cons |   2.075016   .2118047     9.80   0.000     1.655433      2.4946
------------------------------------------------------------------------------
output/tables/management-cohort-ceo.tex
dir : seeout

Average marginal effects                                   Number of obs = 115
Model VCE: Robust

Expression: Linear prediction, predict()
dy/dx wrt:  1950.cohort_ceo 1955.cohort_ceo 1960.cohort_ceo 1965.cohort_ceo
            1970.cohort_ceo 1975.cohort_ceo 1980.cohort_ceo 1985.cohort_ceo

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  cohort_ceo |
       1950  |   .2280387   .2496841     0.91   0.363    -.2665836    .7226611
       1955  |   .6255583   .2237666     2.80   0.006     .1822784    1.068838
       1960  |   .8709544   .1938728     4.49   0.000     .4868939    1.255015
       1965  |   .7476039   .2181344     3.43   0.001     .3154813    1.179727
       1970  |   .7195994   .2266457     3.17   0.002      .270616    1.168583
       1975  |   .7696551   .2756349     2.79   0.006     .2236245    1.315686
       1980  |   .8248062   .2632978     3.13   0.002     .3032153    1.346397
       1985  |   .1256901   .1764412     0.71   0.478    -.2238386    .4752188
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Variables that uniquely identify margins: _deriv
file output/fig/cohort-ceo-marginsplot.png written in PNG format
(start=1945, width=5)
file output/fig/cohort-ceo-histogram.png written in PNG format
(sum of wgt is 199.2858448)

Linear regression                               Number of obs     =        118
                                                F(11, 117)        =      20.46
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3990
                                                Root MSE          =     .58849

                               (Std. err. adjusted for 118 clusters in tax_id)
------------------------------------------------------------------------------
             |               Robust
  management | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
cohort_res~t |
       1950  |   .0044804   .2570008     0.02   0.986    -.5044962    .5134571
       1955  |   .6380783   .1720374     3.71   0.000     .2973673    .9787893
       1960  |   .6871185   .2826744     2.43   0.017     .1272966     1.24694
       1965  |   1.118883   .1748325     6.40   0.000     .7726367     1.46513
       1970  |   1.112372   .1946141     5.72   0.000     .7269491    1.497795
       1975  |   .6389115   .2117917     3.02   0.003     .2194692    1.058354
       1980  |   .7807089   .1839539     4.24   0.000     .4163979     1.14502
       1985  |   .8665722   .2063547     4.20   0.000     .4578975    1.275247
       1990  |   .8935571   .1897415     4.71   0.000     .5177841     1.26933
             |
     foreign |   .4633906   .1345306     3.44   0.001     .1969599    .7298213
entrepreneur |  -.2863211   .1396407    -2.05   0.043    -.5628721     -.00977
       _cons |     2.0058   .1785055    11.24   0.000     1.652279    2.359321
------------------------------------------------------------------------------
output/tables/management-cohort-respondent.tex
dir : seeout

Average marginal effects                                   Number of obs = 118
Model VCE: Robust

Expression: Linear prediction, predict()
dy/dx wrt:  1950.cohort_respondent 1955.cohort_respondent
            1960.cohort_respondent 1965.cohort_respondent
            1970.cohort_respondent 1975.cohort_respondent
            1980.cohort_respondent 1985.cohort_respondent
            1990.cohort_respondent

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
cohort_res~t |
       1950  |   .0044804   .2570008     0.02   0.986    -.5044962    .5134571
       1955  |   .6380783   .1720374     3.71   0.000     .2973673    .9787893
       1960  |   .6871185   .2826744     2.43   0.017     .1272966     1.24694
       1965  |   1.118883   .1748325     6.40   0.000     .7726367     1.46513
       1970  |   1.112372   .1946141     5.72   0.000     .7269491    1.497795
       1975  |   .6389115   .2117917     3.02   0.003     .2194692    1.058354
       1980  |   .7807089   .1839539     4.24   0.000     .4163979     1.14502
       1985  |   .8665722   .2063547     4.20   0.000     .4578975    1.275247
       1990  |   .8935571   .1897415     4.71   0.000     .5177841     1.26933
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Variables that uniquely identify margins: _deriv
file output/fig/cohort-respondent-marginsplot.png written in PNG format
(start=1945, width=5)
file output/fig/cohort-respondent-histogram.png written in PNG format
(sum of wgt is 195.0050857)

Linear regression                               Number of obs     =        115
                                                F(19, 114)        =      66.32
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4667
                                                Root MSE          =      .5792

                               (Std. err. adjusted for 115 clusters in tax_id)
------------------------------------------------------------------------------
             |               Robust
  management | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
cohort_res~t |
       1950  |  -.0121196   .4635224    -0.03   0.979    -.9303539    .9061147
       1955  |   .3887929   .2561208     1.52   0.132    -.1185804    .8961663
       1960  |   .3540599   .4015288     0.88   0.380    -.4413655    1.149485
       1965  |   .7216085   .3689745     1.96   0.053    -.0093271    1.452544
       1970  |   .8641064   .3690627     2.34   0.021      .132996    1.595217
       1975  |   .2819256   .3737414     0.75   0.452    -.4584533    1.022304
       1980  |   .4385621   .3457334     1.27   0.207     -.246333    1.123457
       1985  |   .7816844     .36493     2.14   0.034     .0587609    1.504608
       1990  |   .5478422   .3587742     1.53   0.130    -.1628867    1.258571
             |
  cohort_ceo |
       1950  |   .0448644   .3656886     0.12   0.903    -.6795619    .7692908
       1955  |   .3780651   .2923413     1.29   0.199    -.2010607    .9571909
       1960  |   .5092909   .3301951     1.54   0.126    -.1448231    1.163405
       1965  |   .4222705   .3539211     1.19   0.235    -.2788445    1.123385
       1970  |   .2569953    .348205     0.74   0.462    -.4327962    .9467868
       1975  |   .6148924   .4271447     1.44   0.153    -.2312779    1.461063
       1980  |   .6300142   .3737893     1.69   0.095    -.1104594    1.370488
       1985  |  -.3344116   .3386679    -0.99   0.326     -1.00531    .3364869
             |
     foreign |   .4754994   .1453464     3.27   0.001     .1875692    .7634296
entrepreneur |  -.1875378   .1473818    -1.27   0.206       -.4795    .1044243
       _cons |   1.907017   .1875287    10.17   0.000     1.535524     2.27851
------------------------------------------------------------------------------
output/tables/management-cohort-respondent.tex
dir : seeout

Average marginal effects                                   Number of obs = 115
Model VCE: Robust

Expression: Linear prediction, predict()
dy/dx wrt:  1950.cohort_respondent 1955.cohort_respondent
            1960.cohort_respondent 1965.cohort_respondent
            1970.cohort_respondent 1975.cohort_respondent
            1980.cohort_respondent 1985.cohort_respondent
            1990.cohort_respondent

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
cohort_res~t |
       1950  |  -.0121196   .4635224    -0.03   0.979    -.9303539    .9061147
       1955  |   .3887929   .2561208     1.52   0.132    -.1185804    .8961663
       1960  |   .3540599   .4015288     0.88   0.380    -.4413655    1.149485
       1965  |   .7216085   .3689745     1.96   0.053    -.0093271    1.452544
       1970  |   .8641064   .3690627     2.34   0.021      .132996    1.595217
       1975  |   .2819256   .3737414     0.75   0.452    -.4584533    1.022304
       1980  |   .4385621   .3457334     1.27   0.207     -.246333    1.123457
       1985  |   .7816844     .36493     2.14   0.034     .0587609    1.504608
       1990  |   .5478422   .3587742     1.53   0.130    -.1628867    1.258571
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Variables that uniquely identify margins: _deriv
file output/fig/cohort-respcontrol-marginsplot.png written in PNG format
(start=1945, width=5)
file output/fig/cohort-respcontrol-histogram.png written in PNG format
(sum of wgt is 152.5995714)

Linear regression                               Number of obs     =         87
                                                F(10, 86)         =      12.48
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4272
                                                Root MSE          =     .58012

                                (Std. err. adjusted for 87 clusters in tax_id)
------------------------------------------------------------------------------
             |               Robust
  management | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  cohort_ceo |
       1950  |    .341011   .2655554     1.28   0.203    -.1868956    .8689175
       1955  |   .8801967   .2674956     3.29   0.001     .3484331     1.41196
       1960  |   1.089583   .2190375     4.97   0.000     .6541513    1.525016
       1965  |    .965645   .2543484     3.80   0.000     .4600171    1.471273
       1970  |   .9397925   .2458336     3.82   0.000     .4510915    1.428493
       1975  |   .9525663    .307581     3.10   0.003     .3411155    1.564017
       1980  |   .9585323   .2789354     3.44   0.001      .404027    1.513038
       1985  |   .2667172   .1984547     1.34   0.182    -.1277977     .661232
             |
     foreign |   .4319686   .1613706     2.68   0.009     .1111745    .7527627
entrepreneur |  -.2110012   .1595069    -1.32   0.189    -.5280904     .106088
       _cons |   1.968811   .2298865     8.56   0.000     1.511812     2.42581
------------------------------------------------------------------------------
output/tables/management-cohort-ceo.tex
dir : seeout

Average marginal effects                                    Number of obs = 87
Model VCE: Robust

Expression: Linear prediction, predict()
dy/dx wrt:  1950.cohort_ceo 1955.cohort_ceo 1960.cohort_ceo 1965.cohort_ceo
            1970.cohort_ceo 1975.cohort_ceo 1980.cohort_ceo 1985.cohort_ceo

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  cohort_ceo |
       1950  |    .341011   .2655554     1.28   0.203    -.1868956    .8689175
       1955  |   .8801967   .2674956     3.29   0.001     .3484331     1.41196
       1960  |   1.089583   .2190375     4.97   0.000     .6541513    1.525016
       1965  |    .965645   .2543484     3.80   0.000     .4600171    1.471273
       1970  |   .9397925   .2458336     3.82   0.000     .4510915    1.428493
       1975  |   .9525663    .307581     3.10   0.003     .3411155    1.564017
       1980  |   .9585323   .2789354     3.44   0.001      .404027    1.513038
       1985  |   .2667172   .1984547     1.34   0.182    -.1277977     .661232
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Variables that uniquely identify margins: _deriv
file output/fig/cohort-ceodomestic-marginsplot.png written in PNG format
(start=1945, width=5)
file output/fig/cohort-ceodomestic-histogram.png written in PNG format
(sum of wgt is 42.4055143)

Linear regression                               Number of obs     =         28
                                                F(7, 27)          =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4277
                                                Root MSE          =     .64982

                                (Std. err. adjusted for 28 clusters in tax_id)
------------------------------------------------------------------------------
             |               Robust
  management | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  cohort_ceo |
       1950  |   .4228733   .4368077     0.97   0.342    -.4733821    1.319129
       1955  |   .0509777   .4491485     0.11   0.910    -.8705989    .9725543
       1960  |   .1187331   .3339882     0.36   0.725    -.5665541    .8040204
       1965  |  -.1087033   .2987776    -0.36   0.719    -.7217442    .5043376
       1970  |  -.2646009   .7227735    -0.37   0.717     -1.74761    1.218408
       1975  |  -.3798129   .3080426    -1.23   0.228    -1.011864    .2522383
             |
     foreign |   1.162423   .4526303     2.57   0.016     .2337025    2.091144
entrepreneur |  -.4977914   .3455643    -1.44   0.161    -1.206831     .211248
       _cons |   2.092317   .5821646     3.59   0.001     .8978137     3.28682
------------------------------------------------------------------------------
output/tables/management-cohort-ceo.tex
dir : seeout

Average marginal effects                                    Number of obs = 28
Model VCE: Robust

Expression: Linear prediction, predict()
dy/dx wrt:  1950.cohort_ceo 1955.cohort_ceo 1960.cohort_ceo 1965.cohort_ceo
            1970.cohort_ceo 1975.cohort_ceo

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  cohort_ceo |
       1950  |   .4228733   .4368077     0.97   0.342    -.4733821    1.319129
       1955  |   .0509777   .4491485     0.11   0.910    -.8705989    .9725543
       1960  |   .1187331   .3339882     0.36   0.725    -.5665541    .8040204
       1965  |  -.1087033   .2987776    -0.36   0.719    -.7217442    .5043376
       1970  |  -.2646009   .7227735    -0.37   0.717     -1.74761    1.218408
       1975  |  -.3798129   .3080426    -1.23   0.228    -1.011864    .2522383
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

Variables that uniquely identify margins: _deriv
(file output/fig/cohort-ceoexpat-marginsplot.png not found)
file output/fig/cohort-ceoexpat-marginsplot.png written in PNG format
(start=1945, width=5)
(file output/fig/cohort-ceoexpat-histogram.png not found)
file output/fig/cohort-ceoexpat-histogram.png written in PNG format

. predict management_p
(option xb assumed; fitted values)
(3 missing values generated)

. 
. foreach X in management operations monitoring targets people {
  2.     regress `X' modern_firm [pw=weight], cluster(tax_id)
  3.     outreg2 using "output/tables/`X'-modernity.tex", replace tex(frag pr)
  4.     regress `X' modern_ceo [pw=weight], cluster(tax_id)
  5.     outreg2 using "output/tables/`X'-modernity.tex", tex(frag pr)
  6.     regress `X' modern_respondent [pw=weight], cluster(tax_id)
  7.     outreg2 using "output/tables/`X'-modernity.tex", tex(frag pr)
  8.     regress `X' modern_ceo modern_respondent [pw=weight], cluster(tax_id)
  9.     outreg2 using "output/tables/`X'-modernity.tex", tex(frag pr)
 10.     regress `X' modern_ceo modern_respondent lnL foreign [pw=weight], clus
> ter(tax_id)
 11.     outreg2 using "output/tables/`X'-modernity.tex", tex(frag pr)
 12. }
(sum of wgt is 199.2858448000001)

Linear regression                               Number of obs     =        118
                                                F(1, 117)         =       6.15
                                                Prob > F          =     0.0146
                                                R-squared         =     0.0290
                                                Root MSE          =     .71506

                               (Std. err. adjusted for 118 clusters in tax_id)
------------------------------------------------------------------------------
             |               Robust
  management | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
 modern_firm |  -.4165305   .1679564    -2.48   0.015    -.7491593   -.0839017
       _cons |   3.216115   .1505831    21.36   0.000     2.917893    3.514337
------------------------------------------------------------------------------
output/tables/management-modernity.tex
dir : seeout
(sum of wgt is 195.0050857000001)

Linear regression                               Number of obs     =        115
                                                F(1, 114)         =       1.69
                                                Prob > F          =     0.1957
                                                R-squared         =     0.0158
                                                Root MSE          =     .72142

                               (Std. err. adjusted for 115 clusters in tax_id)
------------------------------------------------------------------------------
             |               Robust
  management | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  modern_ceo |    .181637    .139569     1.30   0.196    -.0948482    .4581221
       _cons |   2.740934   .1072017    25.57   0.000     2.528569      2.9533
------------------------------------------------------------------------------
output/tables/management-modernity.tex
dir : seeout
(sum of wgt is 199.2858448000001)

Linear regression                               Number of obs     =        118
                                                F(1, 117)         =       6.89
                                                Prob > F          =     0.0098
                                                R-squared         =     0.0672
                                                Root MSE          =     .70084

                               (Std. err. adjusted for 118 clusters in tax_id)
------------------------------------------------------------------------------
             |               Robust
  management | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
modern_res~t |   .4238812   .1615391     2.62   0.010     .1039616    .7438009
       _cons |   2.526707   .1413925    17.87   0.000     2.246687    2.806728
------------------------------------------------------------------------------
output/tables/management-modernity.tex
dir : seeout
(sum of wgt is 195.0050857000001)

Linear regression                               Number of obs     =        115
                                                F(2, 114)         =       3.21
                                                Prob > F          =     0.0442
                                                R-squared         =     0.0642
                                                Root MSE          =     .70658

                               (Std. err. adjusted for 115 clusters in tax_id)
------------------------------------------------------------------------------
             |               Robust
  management | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  modern_ceo |   .0517478   .1481378     0.35   0.727     -.241712    .3452075
modern_res~t |   .3867813   .1758845     2.20   0.030     .0383554    .7352073
       _cons |   2.518632   .1469082    17.14   0.000     2.227608    2.809656
------------------------------------------------------------------------------
output/tables/management-modernity.tex
dir : seeout
(sum of wgt is 195.0050857000001)

Linear regression                               Number of obs     =        115
                                                F(4, 114)         =      20.67
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4114
                                                Root MSE          =     .56546

                               (Std. err. adjusted for 115 clusters in tax_id)
------------------------------------------------------------------------------
             |               Robust
  management | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  modern_ceo |   .0700629   .1138035     0.62   0.539    -.1553809    .2955068
modern_res~t |   .2555421   .1402014     1.82   0.071    -.0221958    .5332801
         lnL |   .3447063   .0577847     5.97   0.000     .2302353    .4591773
     foreign |   .4801112   .1125053     4.27   0.000      .257239    .7029834
       _cons |   .7031038   .3052278     2.30   0.023     .0984499    1.307758
------------------------------------------------------------------------------
output/tables/management-modernity.tex
dir : seeout
variable operations not found
r(111);

end of do-file
r(111);
