
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do src/cohorts.do 

. use "temp/data.dta", clear

. 
. do "src/create/variables.do"

. generate lnL = ln(employment_from_balance)

. generate exporter = export > 0

. generate lnQ = ln(sales)

. generate lnK = ln(tanass_clean)
(2 missing values generated)

. generate lnM = ln(ranyag)
(2 missing values generated)

. generate foreign = fo3

. 
. regress lnQ lnK lnL lnM

      Source |       SS           df       MS      Number of obs   =       114
-------------+----------------------------------   F(3, 110)       =   1391.14
       Model |  244.381324         3  81.4604414   Prob > F        =    0.0000
    Residual |  6.44124363       110   .05855676   R-squared       =    0.9743
-------------+----------------------------------   Adj R-squared   =    0.9736
       Total |  250.822568       113  2.21966874   Root MSE        =    .24199

------------------------------------------------------------------------------
         lnQ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         lnK |   .0519114   .0245512     2.11   0.037     .0032568    .1005661
         lnL |   .1977643   .0369054     5.36   0.000     .1246266    .2709021
         lnM |   .7586059    .023559    32.20   0.000     .7119176    .8052943
       _cons |   2.277995   .2074069    10.98   0.000     1.866963    2.689027
------------------------------------------------------------------------------

. predict TFP, resid
(4 missing values generated)

. 
. replace birth_year_firm = foundyear
(91 real changes made)

. 
end of do-file

. 
. local T1 1950

. local T2 1980

. local k 5

. local offset 25

. replace birth_year_firm = birth_year_firm - `offset'
(118 real changes made)

. foreach i in ceo respondent firm {
  2.     generate cohort_`i' = birth_year_`i'
  3.     replace cohort_`i' = `T1' if cohort_`i' <= `T1'
  4.     replace cohort_`i' = `T2' if cohort_`i' > `T2' & !missing(cohort_`i')
  5.     replace cohort_`i' = int(cohort_`i'/`k') * `k'
  6.     * people who were 20 in 1985 could already been exposed to business ed
> ucation
.     generate byte modern_`i' = birth_year_`i' >= 1965 if !missing(birth_year_
> `i')
  7.     generate byte goldrush_`i' = inrange(birth_year_`i', 1965, 1974)
  8. }
(3 missing values generated)
(7 real changes made)
(8 real changes made)
(82 real changes made)
(3 missing values generated)
(3 real changes made)
(25 real changes made)
(68 real changes made)
(5 real changes made)
(12 real changes made)
(76 real changes made)

. replace birth_year_firm = birth_year_firm + `offset'
(118 real changes made)

. replace cohort_firm = cohort_firm + `offset'
(118 real changes made)

. 
. tabulate cohort_firm

cohort_firm |      Freq.     Percent        Cum.
------------+-----------------------------------
       1975 |          5        4.24        4.24
       1980 |          1        0.85        5.08
       1985 |          6        5.08       10.17
       1990 |         46       38.98       49.15
       1995 |         29       24.58       73.73
       2000 |         17       14.41       88.14
       2005 |         14       11.86      100.00
------------+-----------------------------------
      Total |        118      100.00

. tabulate cohort_ceo

 cohort_ceo |      Freq.     Percent        Cum.
------------+-----------------------------------
       1950 |         21       18.26       18.26
       1955 |         19       16.52       34.78
       1960 |         18       15.65       50.43
       1965 |         16       13.91       64.35
       1970 |         22       19.13       83.48
       1975 |         10        8.70       92.17
       1980 |          9        7.83      100.00
------------+-----------------------------------
      Total |        115      100.00

. tabulate cohort_respondent

cohort_resp |
     ondent |      Freq.     Percent        Cum.
------------+-----------------------------------
       1950 |          7        5.93        5.93
       1955 |         11        9.32       15.25
       1960 |          9        7.63       22.88
       1965 |         13       11.02       33.90
       1970 |         20       16.95       50.85
       1975 |         26       22.03       72.88
       1980 |         32       27.12      100.00
------------+-----------------------------------
      Total |        118      100.00

. tabulate modern_ceo modern_respondent

           |   modern_respondent
modern_ceo |         0          1 |     Total
-----------+----------------------+----------
         0 |        23         35 |        58 
         1 |         4         53 |        57 
-----------+----------------------+----------
     Total |        27         88 |       115 

. tabulate modern_respondent goldrush_respondent

modern_res |  goldrush_respondent
   pondent |         0          1 |     Total
-----------+----------------------+----------
         0 |        27          0 |        27 
         1 |        58         33 |        91 
-----------+----------------------+----------
     Total |        85         33 |       118 

. 
. summarize management [aw=weight], detail

                  ADJUSTED MANAGEMENT SCORE
-------------------------------------------------------------
      Percentiles      Smallest
 1%     1.259873       1.167021
 5%     1.597149       1.259873
10%     1.763816       1.263816       Obs                 118
25%      2.20826       1.263816       Sum of wgt.  199.285845

50%     2.936157                      Mean           2.839376
                        Largest       Std. dev.       .722534
75%     3.319371       4.055909
90%     3.763816       4.097149       Variance       .5220553
95%     3.989866       4.222576       Skewness      -.3005594
99%     4.222576       4.269489       Kurtosis       2.387017

. regress management i.cohort_firm [pw=weight], cluster(tax_id)
(sum of wgt is 199.2858448)

Linear regression                               Number of obs     =        118
                                                F(5, 117)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0610
                                                Root MSE          =     .71883

                               (Std. err. adjusted for 118 clusters in tax_id)
------------------------------------------------------------------------------
             |               Robust
  management | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
 cohort_firm |
       1980  |  -1.204616   .1885459    -6.39   0.000    -1.578022   -.8312111
       1985  |   .0579992    .287348     0.20   0.840    -.5110785     .627077
       1990  |  -.4958509   .2136898    -2.32   0.022    -.9190523   -.0726496
       1995  |  -.5490595   .2475584    -2.22   0.028    -1.039336   -.0587831
       2000  |   -.371701   .2432823    -1.53   0.129     -.853509    .1101069
       2005  |  -.2572643   .3060758    -0.84   0.402    -.8634314    .3489028
             |
       _cons |   3.253306   .1885459    17.25   0.000     2.879901    3.626712
------------------------------------------------------------------------------

. regress management i.cohort_respondent [pw=weight], cluster(tax_id)
(sum of wgt is 199.2858448)

Linear regression                               Number of obs     =        118
                                                F(6, 117)         =       9.44
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2229
                                                Root MSE          =     .65394

                               (Std. err. adjusted for 118 clusters in tax_id)
------------------------------------------------------------------------------
             |               Robust
  management | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
cohort_res~t |
       1955  |   .9076671   .2188406     4.15   0.000     .4742648    1.341069
       1960  |   .9732724   .3053394     3.19   0.002     .3685638    1.577981
       1965  |    1.43516   .2367564     6.06   0.000      .966276    1.904043
       1970  |   1.383405   .2019638     6.85   0.000     .9834264    1.783384
       1975  |     .82949   .2352309     3.53   0.001     .3636274    1.295352
       1980  |   1.149348   .2089216     5.50   0.000     .7355895    1.563106
             |
       _cons |   1.807364   .1679648    10.76   0.000     1.474718    2.140009
------------------------------------------------------------------------------

. *regress zmanagement i.cohort_respondent i.cohort_ceo [pw=weight], cluster(ta
> x_id)
. 
. foreach X in management operations monitoring targets people {
  2.     regress `X' modern_firm [pw=weight], cluster(tax_id)
  3.     regress `X' modern_ceo [pw=weight], cluster(tax_id)
  4.     regress `X' modern_respondent [pw=weight], cluster(tax_id)
  5.     regress `X' modern_ceo modern_respondent [pw=weight], cluster(tax_id)
  6. }
(sum of wgt is 199.2858448000001)

Linear regression                               Number of obs     =        118
                                                F(1, 117)         =       6.15
                                                Prob > F          =     0.0146
                                                R-squared         =     0.0290
                                                Root MSE          =     .71506

                               (Std. err. adjusted for 118 clusters in tax_id)
------------------------------------------------------------------------------
             |               Robust
  management | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
 modern_firm |  -.4165305   .1679564    -2.48   0.015    -.7491593   -.0839017
       _cons |   3.216115   .1505831    21.36   0.000     2.917893    3.514337
------------------------------------------------------------------------------
(sum of wgt is 195.0050857000001)

Linear regression                               Number of obs     =        115
                                                F(1, 114)         =       1.69
                                                Prob > F          =     0.1957
                                                R-squared         =     0.0158
                                                Root MSE          =     .72142

                               (Std. err. adjusted for 115 clusters in tax_id)
------------------------------------------------------------------------------
             |               Robust
  management | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  modern_ceo |    .181637    .139569     1.30   0.196    -.0948482    .4581221
       _cons |   2.740934   .1072017    25.57   0.000     2.528569      2.9533
------------------------------------------------------------------------------
(sum of wgt is 199.2858448000001)

Linear regression                               Number of obs     =        118
                                                F(1, 117)         =       6.89
                                                Prob > F          =     0.0098
                                                R-squared         =     0.0672
                                                Root MSE          =     .70084

                               (Std. err. adjusted for 118 clusters in tax_id)
------------------------------------------------------------------------------
             |               Robust
  management | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
modern_res~t |   .4238812   .1615391     2.62   0.010     .1039616    .7438009
       _cons |   2.526707   .1413925    17.87   0.000     2.246687    2.806728
------------------------------------------------------------------------------
(sum of wgt is 195.0050857000001)

Linear regression                               Number of obs     =        115
                                                F(2, 114)         =       3.21
                                                Prob > F          =     0.0442
                                                R-squared         =     0.0642
                                                Root MSE          =     .70658

                               (Std. err. adjusted for 115 clusters in tax_id)
------------------------------------------------------------------------------
             |               Robust
  management | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  modern_ceo |   .0517478   .1481378     0.35   0.727     -.241712    .3452075
modern_res~t |   .3867813   .1758845     2.20   0.030     .0383554    .7352073
       _cons |   2.518632   .1469082    17.14   0.000     2.227608    2.809656
------------------------------------------------------------------------------
variable operations not found
r(111);

end of do-file
r(111);
