
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do src/cohorts.do 

. use "temp/data.dta", clear

. 
. do "src/create/variables.do"

. generate lnL = ln(employment_from_balance)

. generate exporter = export > 0

. generate lnQ = ln(sales)

. generate lnK = ln(tanass_clean)
(2 missing values generated)

. generate lnM = ln(ranyag)
(2 missing values generated)

. generate foreign = fo3

. 
. regress lnQ lnK lnL lnM

      Source |       SS           df       MS      Number of obs   =       114
-------------+----------------------------------   F(3, 110)       =   1391.14
       Model |  244.381324         3  81.4604414   Prob > F        =    0.0000
    Residual |  6.44124363       110   .05855676   R-squared       =    0.9743
-------------+----------------------------------   Adj R-squared   =    0.9736
       Total |  250.822568       113  2.21966874   Root MSE        =    .24199

------------------------------------------------------------------------------
         lnQ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         lnK |   .0519114   .0245512     2.11   0.037     .0032568    .1005661
         lnL |   .1977643   .0369054     5.36   0.000     .1246266    .2709021
         lnM |   .7586059    .023559    32.20   0.000     .7119176    .8052943
       _cons |   2.277995   .2074069    10.98   0.000     1.866963    2.689027
------------------------------------------------------------------------------

. predict TFP, resid
(4 missing values generated)

. 
. replace birth_year_firm = foundyear
(91 real changes made)

. 
end of do-file

. 
. local T1 1945

. local T2 1995

. local k 5

. local offset 25

. replace birth_year_firm = birth_year_firm - `offset'
(118 real changes made)

. foreach i in ceo respondent firm {
  2.     generate cohort_`i' = birth_year_`i'
  3.     replace cohort_`i' = `T1' if cohort_`i' <= `T1'
  4.     replace cohort_`i' = `T2' if cohort_`i' > `T2' & !missing(cohort_`i')
  5.     replace cohort_`i' = int(cohort_`i'/`k') * `k'
  6.     * people who were 20 in 1985 could already been exposed to business ed
> ucation
.     generate byte modern_`i' = birth_year_`i' >= 1965 if !missing(birth_year_
> `i')
  7.     generate byte goldrush_`i' = inrange(birth_year_`i', 1965, 1974)
  8. }
(3 missing values generated)
(2 real changes made)
(0 real changes made)
(93 real changes made)
(3 missing values generated)
(1 real change made)
(0 real changes made)
(90 real changes made)
(4 real changes made)
(0 real changes made)
(87 real changes made)

. replace birth_year_firm = birth_year_firm + `offset'
(118 real changes made)

. replace cohort_firm = cohort_firm + `offset'
(118 real changes made)

. 
. tabulate cohort_firm

cohort_firm |      Freq.     Percent        Cum.
------------+-----------------------------------
       1970 |          5        4.24        4.24
       1980 |          1        0.85        5.08
       1985 |          6        5.08       10.17
       1990 |         46       38.98       49.15
       1995 |         29       24.58       73.73
       2000 |         17       14.41       88.14
       2005 |          8        6.78       94.92
       2010 |          6        5.08      100.00
------------+-----------------------------------
      Total |        118      100.00

. tabulate cohort_ceo

 cohort_ceo |      Freq.     Percent        Cum.
------------+-----------------------------------
       1945 |          7        6.09        6.09
       1950 |         14       12.17       18.26
       1955 |         19       16.52       34.78
       1960 |         18       15.65       50.43
       1965 |         16       13.91       64.35
       1970 |         22       19.13       83.48
       1975 |         10        8.70       92.17
       1980 |          6        5.22       97.39
       1985 |          3        2.61      100.00
------------+-----------------------------------
      Total |        115      100.00

. tabulate cohort_respondent

cohort_resp |
     ondent |      Freq.     Percent        Cum.
------------+-----------------------------------
       1945 |          3        2.54        2.54
       1950 |          4        3.39        5.93
       1955 |         11        9.32       15.25
       1960 |          9        7.63       22.88
       1965 |         13       11.02       33.90
       1970 |         20       16.95       50.85
       1975 |         26       22.03       72.88
       1980 |         21       17.80       90.68
       1985 |          9        7.63       98.31
       1990 |          2        1.69      100.00
------------+-----------------------------------
      Total |        118      100.00

. tabulate modern_ceo modern_respondent

           |   modern_respondent
modern_ceo |         0          1 |     Total
-----------+----------------------+----------
         0 |        23         35 |        58 
         1 |         4         53 |        57 
-----------+----------------------+----------
     Total |        27         88 |       115 

. tabulate modern_respondent goldrush_respondent

modern_res |  goldrush_respondent
   pondent |         0          1 |     Total
-----------+----------------------+----------
         0 |        27          0 |        27 
         1 |        58         33 |        91 
-----------+----------------------+----------
     Total |        85         33 |       118 

. 
. summarize management [aw=weight], detail

                  ADJUSTED MANAGEMENT SCORE
-------------------------------------------------------------
      Percentiles      Smallest
 1%     1.259873       1.167021
 5%     1.597149       1.259873
10%     1.763816       1.263816       Obs                 118
25%      2.20826       1.263816       Sum of wgt.  199.285845

50%     2.936157                      Mean           2.839376
                        Largest       Std. dev.       .722534
75%     3.319371       4.055909
90%     3.763816       4.097149       Variance       .5220553
95%     3.989866       4.222576       Skewness      -.3005594
99%     4.222576       4.269489       Kurtosis       2.387017

. regress management i.cohort_firm [pw=weight], cluster(tax_id)
(sum of wgt is 199.2858448)

Linear regression                               Number of obs     =        118
                                                F(6, 117)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1064
                                                Root MSE          =     .70442

                               (Std. err. adjusted for 118 clusters in tax_id)
------------------------------------------------------------------------------
             |               Robust
  management | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
 cohort_firm |
       1980  |  -1.204616    .189401    -6.36   0.000    -1.579715   -.8295176
       1985  |   .0579992   .2886512     0.20   0.841    -.5136594    .6296578
       1990  |  -.4958509   .2146589    -2.31   0.023    -.9209716   -.0707303
       1995  |  -.5490595   .2486811    -2.21   0.029    -1.041559   -.0565596
       2000  |   -.371701   .2443857    -1.52   0.131     -.855694     .112292
       2005  |   .1764411   .2788041     0.63   0.528    -.3757158     .728598
       2010  |  -.6461351   .3890489    -1.66   0.099    -1.416626    .1243559
             |
       _cons |   3.253306    .189401    17.18   0.000     2.878208    3.628405
------------------------------------------------------------------------------

. outreg2 using "output/tables/management-cohort-firm.tex", replace tex(frag pr
> )
output/tables/management-cohort-firm.tex
dir : seeout

. regress management i.cohort_respondent [pw=weight], cluster(tax_id)
(sum of wgt is 199.2858448)

Linear regression                               Number of obs     =        118
                                                F(9, 117)         =      20.52
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2292
                                                Root MSE          =     .66023

                               (Std. err. adjusted for 118 clusters in tax_id)
------------------------------------------------------------------------------
             |               Robust
  management | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
cohort_res~t |
       1950  |   .1623757   .3313033     0.49   0.625    -.4937532    .8185046
       1955  |   .9955519   .1798927     5.53   0.000     .6392839     1.35182
       1960  |   1.061157   .2810014     3.78   0.000     .5046488    1.617666
       1965  |   1.523044   .2018675     7.54   0.000     1.123256    1.922832
       1970  |    1.47129   .1583107     9.29   0.000     1.157764    1.784816
       1975  |   .9173748   .2000262     4.59   0.000     .5212334    1.313516
       1980  |   1.211346   .1877505     6.45   0.000     .8395156    1.583176
       1985  |   1.206054   .2702804     4.46   0.000     .6707778     1.74133
       1990  |   1.643269   .1303114    12.61   0.000     1.385194    1.901344
             |
       _cons |   1.719479   .1101622    15.61   0.000     1.501308    1.937649
------------------------------------------------------------------------------

. outreg2 using "output/tables/management-cohort-resp.tex", replace tex(frag pr
> )
output/tables/management-cohort-resp.tex
dir : seeout

. regress management ib`T1'.cohort_respondent lnL foreign [pw=weight], cluster(
> tax_id)
(sum of wgt is 199.2858448)

Linear regression                               Number of obs     =        118
                                                F(11, 117)        =      23.62
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4634
                                                Root MSE          =     .55606

                               (Std. err. adjusted for 118 clusters in tax_id)
------------------------------------------------------------------------------
             |               Robust
  management | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
cohort_res~t |
       1950  |   .0273815   .2306595     0.12   0.906    -.4294276    .4841906
       1955  |   .5333781   .1725925     3.09   0.002     .1915678    .8751884
       1960  |   .7275701   .2553233     2.85   0.005     .2219157    1.233224
       1965  |    1.04407   .1556799     6.71   0.000     .7357536    1.352385
       1970  |   .8718268   .1798173     4.85   0.000     .5157081    1.227945
       1975  |   .6102018   .1792547     3.40   0.001     .2551973    .9652064
       1980  |   .8014187   .1597198     5.02   0.000      .485102    1.117735
       1985  |   .7555285   .2087177     3.62   0.000     .3421742    1.168883
       1990  |   .9723748   .1996581     4.87   0.000     .5769623    1.367787
             |
         lnL |   .3045076   .0610309     4.99   0.000     .1836391    .4253761
     foreign |   .4005131   .1116383     3.59   0.000     .1794192     .621607
       _cons |   .4547654   .2707376     1.68   0.096    -.0814162    .9909469
------------------------------------------------------------------------------

. outreg2 using "output/tables/management-cohort-resp.tex", tex(frag pr)
output/tables/management-cohort-resp.tex
dir : seeout

. predict management_p
(option xb assumed; fitted values)

. 
. * X axis: cohort of respondency, Y axis, estimated management score, relative
>  to baseline, 1945
. margins, dydx(ib1945.cohort_respondent)

Average marginal effects                                   Number of obs = 118
Model VCE: Robust

Expression: Linear prediction, predict()
dy/dx wrt:  1950.cohort_respondent 1955.cohort_respondent
            1960.cohort_respondent 1965.cohort_respondent
            1970.cohort_respondent 1975.cohort_respondent
            1980.cohort_respondent 1985.cohort_respondent
            1990.cohort_respondent

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
cohort_res~t |
       1950  |   .0273815   .2306595     0.12   0.906    -.4294276    .4841906
       1955  |   .5333781   .1725925     3.09   0.002     .1915678    .8751884
       1960  |   .7275701   .2553233     2.85   0.005     .2219157    1.233224
       1965  |    1.04407   .1556799     6.71   0.000     .7357536    1.352385
       1970  |   .8718268   .1798173     4.85   0.000     .5157081    1.227945
       1975  |   .6102018   .1792547     3.40   0.001     .2551973    .9652064
       1980  |   .8014187   .1597198     5.02   0.000      .485102    1.117735
       1985  |   .7555285   .2087177     3.62   0.000     .3421742    1.168883
       1990  |   .9723748   .1996581     4.87   0.000     .5769623    1.367787
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

. marginsplot, recast(scatter) yline(0) nolabels xlabel(1 "1950" 2 "1955" 3 "19
> 60" 4 "1965" 5 "1970" 6 "1975" 7 "1980" 8 "1985" 9 "1990") xtitle("Birth year
>  of respondent") ytitle("Management score, relative to 1945")

Variables that uniquely identify margins: _deriv

. graph export "output/fig/cohort-resp-marginsplot.png", replace
file output/fig/cohort-resp-marginsplot.png written in PNG format

. 
. foreach X in management operations monitoring targets people {
  2.     regress `X' modern_firm [pw=weight], cluster(tax_id)
  3.     outreg2 using "output/tables/`X'-modernity.tex", replace tex(frag pr)
  4.     regress `X' modern_ceo [pw=weight], cluster(tax_id)
  5.     outreg2 using "output/tables/`X'-modernity.tex", tex(frag pr)
  6.     regress `X' modern_respondent [pw=weight], cluster(tax_id)
  7.     outreg2 using "output/tables/`X'-modernity.tex", tex(frag pr)
  8.     regress `X' modern_ceo modern_respondent [pw=weight], cluster(tax_id)
  9.     outreg2 using "output/tables/`X'-modernity.tex", tex(frag pr)
 10.     regress `X' modern_ceo modern_respondent lnL foreign [pw=weight], clus
> ter(tax_id)
 11.     outreg2 using "output/tables/`X'-modernity.tex", tex(frag pr)
 12. }
(sum of wgt is 199.2858448000001)

Linear regression                               Number of obs     =        118
                                                F(1, 117)         =       6.15
                                                Prob > F          =     0.0146
                                                R-squared         =     0.0290
                                                Root MSE          =     .71506

                               (Std. err. adjusted for 118 clusters in tax_id)
------------------------------------------------------------------------------
             |               Robust
  management | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
 modern_firm |  -.4165305   .1679564    -2.48   0.015    -.7491593   -.0839017
       _cons |   3.216115   .1505831    21.36   0.000     2.917893    3.514337
------------------------------------------------------------------------------
output/tables/management-modernity.tex
dir : seeout
(sum of wgt is 195.0050857000001)

Linear regression                               Number of obs     =        115
                                                F(1, 114)         =       1.69
                                                Prob > F          =     0.1957
                                                R-squared         =     0.0158
                                                Root MSE          =     .72142

                               (Std. err. adjusted for 115 clusters in tax_id)
------------------------------------------------------------------------------
             |               Robust
  management | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  modern_ceo |    .181637    .139569     1.30   0.196    -.0948482    .4581221
       _cons |   2.740934   .1072017    25.57   0.000     2.528569      2.9533
------------------------------------------------------------------------------
output/tables/management-modernity.tex
dir : seeout
(sum of wgt is 199.2858448000001)

Linear regression                               Number of obs     =        118
                                                F(1, 117)         =       6.89
                                                Prob > F          =     0.0098
                                                R-squared         =     0.0672
                                                Root MSE          =     .70084

                               (Std. err. adjusted for 118 clusters in tax_id)
------------------------------------------------------------------------------
             |               Robust
  management | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
modern_res~t |   .4238812   .1615391     2.62   0.010     .1039616    .7438009
       _cons |   2.526707   .1413925    17.87   0.000     2.246687    2.806728
------------------------------------------------------------------------------
output/tables/management-modernity.tex
dir : seeout
(sum of wgt is 195.0050857000001)

Linear regression                               Number of obs     =        115
                                                F(2, 114)         =       3.21
                                                Prob > F          =     0.0442
                                                R-squared         =     0.0642
                                                Root MSE          =     .70658

                               (Std. err. adjusted for 115 clusters in tax_id)
------------------------------------------------------------------------------
             |               Robust
  management | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  modern_ceo |   .0517478   .1481378     0.35   0.727     -.241712    .3452075
modern_res~t |   .3867813   .1758845     2.20   0.030     .0383554    .7352073
       _cons |   2.518632   .1469082    17.14   0.000     2.227608    2.809656
------------------------------------------------------------------------------
output/tables/management-modernity.tex
dir : seeout
(sum of wgt is 195.0050857000001)

Linear regression                               Number of obs     =        115
                                                F(4, 114)         =      20.67
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4114
                                                Root MSE          =     .56546

                               (Std. err. adjusted for 115 clusters in tax_id)
------------------------------------------------------------------------------
             |               Robust
  management | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  modern_ceo |   .0700629   .1138035     0.62   0.539    -.1553809    .2955068
modern_res~t |   .2555421   .1402014     1.82   0.071    -.0221958    .5332801
         lnL |   .3447063   .0577847     5.97   0.000     .2302353    .4591773
     foreign |   .4801112   .1125053     4.27   0.000      .257239    .7029834
       _cons |   .7031038   .3052278     2.30   0.023     .0984499    1.307758
------------------------------------------------------------------------------
output/tables/management-modernity.tex
dir : seeout
variable operations not found
r(111);

end of do-file
r(111);
