
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do src/practices.do 

. clear all

. use "temp/data.dta"

. 
. do "src/create/variables.do"

. generate lnL = ln(employment_from_balance)

. generate exporter = export > 0

. generate lnQ = ln(sales)

. generate lnK = ln(tanass_clean)
(2 missing values generated)

. generate lnM = ln(ranyag)
(2 missing values generated)

. generate foreign = fo3

. 
. regress lnQ lnK lnL lnM

      Source |       SS           df       MS      Number of obs   =       114
-------------+----------------------------------   F(3, 110)       =   1391.14
       Model |  244.381324         3  81.4604414   Prob > F        =    0.0000
    Residual |  6.44124363       110   .05855676   R-squared       =    0.9743
-------------+----------------------------------   Adj R-squared   =    0.9736
       Total |  250.822568       113  2.21966874   Root MSE        =    .24199

------------------------------------------------------------------------------
         lnQ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         lnK |   .0519114   .0245512     2.11   0.037     .0032568    .1005661
         lnL |   .1977643   .0369054     5.36   0.000     .1246266    .2709021
         lnM |   .7586059    .023559    32.20   0.000     .7119176    .8052943
       _cons |   2.277995   .2074069    10.98   0.000     1.866963    2.689027
------------------------------------------------------------------------------

. predict TFP, resid
(4 missing values generated)

. 
. replace birth_year_firm = foundyear
(91 real changes made)

. 
end of do-file

. 
. regress management lnL [pw=weight], robust
(sum of wgt is 199.2858448000001)

Linear regression                               Number of obs     =        118
                                                F(1, 116)         =      58.87
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2838
                                                Root MSE          =      .6141

------------------------------------------------------------------------------
             |               Robust
  management | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         lnL |   .4549849   .0592973     7.67   0.000     .3375391    .5724306
       _cons |   .5680891   .3180214     1.79   0.077    -.0617924    1.197971
------------------------------------------------------------------------------

. outreg2 using "output/tables/management-lnL.tex",replace tex(frag pr)
output/tables/management-lnL.tex
dir : seeout

. regress management lnL entrepreneur [pw=weight], robust
(sum of wgt is 199.2858448000001)

Linear regression                               Number of obs     =        118
                                                F(2, 115)         =      35.07
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3243
                                                Root MSE          =     .59908

------------------------------------------------------------------------------
             |               Robust
  management | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         lnL |   .3818581   .0615333     6.21   0.000     .2599724    .5037437
entrepreneur |  -.3185431   .1283767    -2.48   0.015    -.5728326   -.0642537
       _cons |   1.067653   .3524714     3.03   0.003     .3694747    1.765831
------------------------------------------------------------------------------

. outreg2 using "output/tables/management-lnL.tex",replace tex(frag pr)
output/tables/management-lnL.tex
dir : seeout

. regress management lnL foreign [pw=weight], robust
(sum of wgt is 199.2858448000001)

Linear regression                               Number of obs     =        118
                                                F(2, 115)         =      35.12
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3692
                                                Root MSE          =     .57882

------------------------------------------------------------------------------
             |               Robust
  management | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         lnL |   .3614144    .058905     6.14   0.000     .2447349     .478094
     foreign |   .4605322   .1090406     4.22   0.000     .2445437    .6765206
       _cons |   .8558315   .3022814     2.83   0.005     .2570702    1.454593
------------------------------------------------------------------------------

. outreg2 using "output/tables/management-lnL.tex", tex(frag pr)
output/tables/management-lnL.tex
dir : seeout

. regress management lnL exporter [pw=weight], robust
(sum of wgt is 199.2858448000001)

Linear regression                               Number of obs     =        118
                                                F(2, 115)         =      31.05
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3045
                                                Root MSE          =      .6078

------------------------------------------------------------------------------
             |               Robust
  management | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         lnL |   .3984952    .067855     5.87   0.000     .2640875    .5329029
    exporter |   .2737166   .1651633     1.66   0.100    -.0534402    .6008733
       _cons |   .6372931   .3200949     1.99   0.049     .0032467     1.27134
------------------------------------------------------------------------------

. outreg2 using "output/tables/management-lnL.tex", tex(frag pr)
output/tables/management-lnL.tex
dir : seeout

. regress management lnL expat [pw=weight], robust
(sum of wgt is 199.2858448000001)

Linear regression                               Number of obs     =        118
                                                F(2, 115)         =      29.25
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2870
                                                Root MSE          =      .6154

------------------------------------------------------------------------------
             |               Robust
  management | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         lnL |   .4486869   .0599865     7.48   0.000     .3298652    .5675086
       expat |   .0990549   .1515051     0.65   0.515    -.2010475    .3991574
       _cons |   .5779538   .3190951     1.81   0.073    -.0541121     1.21002
------------------------------------------------------------------------------

. outreg2 using "output/tables/management-lnL.tex", tex(frag pr)
output/tables/management-lnL.tex
dir : seeout

. 
. local outcomes lnQ TFP exporter 

. 
. foreach Y in `outcomes' {
  2.     regress `Y' management lnL foreign [pw=weight], robust
  3.     if "`Y'" == "lnQ"{
  4.         outreg2 using "output/tables/outcomes-management.tex",replace tex(
> frag pr)
  5.     }
  6.     else {
  7.         outreg2 using "output/tables/outcomes-management.tex", tex(frag pr
> )
  8.     }
  9. }
(sum of wgt is 199.2858448000001)

Linear regression                               Number of obs     =        118
                                                F(3, 114)         =      35.13
                                                Prob > F          =     0.0000
                                                R-squared         =     0.5462
                                                Root MSE          =     1.0714

------------------------------------------------------------------------------
             |               Robust
         lnQ | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  management |   .4539172   .1711431     2.65   0.009     .1148841    .7929503
         lnL |   1.096879   .1474111     7.44   0.000     .8048592      1.3889
     foreign |    .107757   .2174445     0.50   0.621     -.322999    .5385129
       _cons |   8.167166   .6817391    11.98   0.000     6.816646    9.517686
------------------------------------------------------------------------------
output/tables/outcomes-management.tex
dir : seeout
(sum of wgt is 194.0050857000001)

Linear regression                               Number of obs     =        114
                                                F(3, 110)         =       0.60
                                                Prob > F          =     0.6132
                                                R-squared         =     0.0252
                                                Root MSE          =       .235

------------------------------------------------------------------------------
             |               Robust
         TFP | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  management |   .0384553   .0477759     0.80   0.423    -.0562253    .1331359
         lnL |  -.0063911   .0377085    -0.17   0.866    -.0811205    .0683383
     foreign |     .03808   .0419815     0.91   0.366    -.0451175    .1212775
       _cons |  -.0901221   .1477753    -0.61   0.543     -.382978    .2027339
------------------------------------------------------------------------------
output/tables/outcomes-management.tex
dir : seeout
(sum of wgt is 199.2858448000001)

Linear regression                               Number of obs     =        118
                                                F(3, 114)         =       9.23
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2059
                                                Root MSE          =     .37715

------------------------------------------------------------------------------
             |               Robust
    exporter | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  management |    .083875   .0670295     1.25   0.213      -.04891      .21666
         lnL |   .1512992   .0481409     3.14   0.002     .0559324     .246666
     foreign |   .0832718   .0703114     1.18   0.239    -.0560145    .2225582
       _cons |  -.2484508   .2354724    -1.06   0.294    -.7149198    .2180182
------------------------------------------------------------------------------
output/tables/outcomes-management.tex
dir : seeout

.  
. 
end of do-file
